# Використовуємо офіційний легкий образ Python
FROM python:3.11-slim

# Встановлюємо робочу директорію всередині контейнера
WORKDIR /app

# Спочатку копіюємо ТІЛЬКИ requirements.txt
# (Це робиться для оптимізації кешу Docker: якщо залежності не змінилися, Docker не буде їх перевстановлювати)
COPY requirements.txt .

# Встановлюємо бібліотеки без збереження зайвого кешу
RUN pip install --no-cache-dir -r requirements.txt

# Копіюємо всі інші файли бекенду
# (Папка frontend та інші файли з .dockerignore сюди не потраплять)
COPY . .

# Вказуємо, що контейнер слухатиме порт 5000
EXPOSE 5001

# Команда для запуску твого Flask-сервера
CMD ["python", "run.py"]